lib/tasks/repo_dymo.rake

  task delete_duplicate_labels: :environment do
    duplicates = Label.all - Label.all.uniq{|label| label.name}
---
SELECT "labels".* FROM "labels"