app/controllers/labels_controller.rb

  def index
    @labels = Label.all
---
SELECT "labels".* FROM "labels"

  def update
    respond_to do |format|
      if @label.update(label_params)
---
UPDATE "labels" SET "color" = ?, "updated_at" = ? WHERE "labels"."id" = ?  [["color", "f5f5f5"], ["updated_at", "2019-01-21 19:53:20.508503"], ["id", 1]]

  def destroy
    @label.destroy
---
DELETE FROM "labels" WHERE "labels"."id" = ?  [["id", 4]]

    def set_label
      @label = Label.find(params[:id])
---
SELECT  "labels".* FROM "labels" WHERE "labels"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]