app/models/github_label_cloner.rb

SELECT "labels".* FROM "labels"
INSERT INTO "labels" ("name", "color", "default", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "breaking change"], ["color", "e10c02"], ["default", 0], ["created_at", "2019-01-21 21:40:38.707114"], ["updated_at", "2019-01-21 21:40:38.707114"]]
SELECT  1 AS one FROM "labels" WHERE "labels"."name" = ? LIMIT ?  [["name", "App:EEx"], ["LIMIT", 1]]
---
  def clone_github_labels
    repo_labels = Octokit.labels(@source_repo_path)

    repo_labels.map do |label|
      created_label = Label.create( name:    label.name,
                                    color:   label.color,
                                    default: label.default )
      @client.add_label(@target_repo_path, created_label.name, created_label.color) unless Label.where(name: created_label.name).exists?